pok3r-custom/pok3r_re_firmware/doc/Holtek/HT32F1655_56_FWLib_v102_960/library/HT32F1655_56_Driver/inc/ht32f1655_56_mctm.h
/*********************************************************************************************************//**
 * @file    ht32f1655_56_mctm.h
 * @version $Rev:: 921          $
 * @date    $Date:: 2015-09-16 #$
 * @brief   The header file of the MCTM library.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) 2014 Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------------------------------------*/
#ifndef __HT32F1655_56_MCTM_H
#define __HT32F1655_56_MCTM_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f1655_56.h"

/** @addtogroup HT32F1655_56_Peripheral_Driver HT32F1655/1656 Peripheral Driver
  * @{
  */

/** @addtogroup MCTM
  * @{
  */


/* Exported types ------------------------------------------------------------------------------------------*/
/** @defgroup MCTM_Exported_Types MCTM exported types
  * @{
  */
/**
 * @brief  Enumeration of MCTM counter mode.
 */
typedef enum
{
  MCTM_CNT_MODE_UP   = 0x00000000,  /*!< Edge up-counting mode                                              */
  MCTM_CNT_MODE_CA1  = 0x00010000,  /*!< Center-align mode 1                                                */
  MCTM_CNT_MODE_CA2  = 0x00020000,  /*!< Center-align mode 2                                                */
  MCTM_CNT_MODE_CA3  = 0x00030000,  /*!< Center-align mode 3                                                */
  MCTM_CNT_MODE_DOWN = 0x01000000   /*!< Edge down-counting mode                                            */
} MCTM_CNT_MODE_Enum;
/**
 * @brief Enumeration of  MCTM prescaler reload time.
 */
typedef enum
{
  MCTM_PSC_RLD_UPDATE    = 0x0000,  /*!< Reload prescaler at next update event                              */
  MCTM_PSC_RLD_IMMEDIATE = 0x0100   /*!< Reload prescaler immediately                                       */
} MCTM_PSC_RLD_Enum;
/**
 * @brief Enumeration of MCTM channel.
 */
typedef enum
{
  MCTM_CH_0 = 0,                    /*!< MCTM channel 0                                                     */
  MCTM_CH_1,                        /*!< MCTM channel 1                                                     */
  MCTM_CH_2,                        /*!< MCTM channel 2                                                     */
  MCTM_CH_3                         /*!< MCTM channel 3                                                     */
} MCTM_CH_Enum;
/**
 * @brief Enumeration of MCTM channel output mode.
 */
typedef enum
{
  MCTM_OM_MATCH_NOCHANGE  = 0x0000, /*!< MCTM channel output no change on match                             */
  MCTM_OM_MATCH_INACTIVE  = 0x0001, /*!< MCTM channel output inactive level on match                        */
  MCTM_OM_MATCH_ACTIVE    = 0x0002, /*!< MCTM channel output active level on match                          */
  MCTM_OM_MATCH_TOGGLE    = 0x0003, /*!< MCTM channel output toggle on match                                */
  MCTM_OM_FORCED_INACTIVE = 0x0004, /*!< MCTM channel output forced inactive level                          */
  MCTM_OM_FORCED_ACTIVE   = 0x0005, /*!< MCTM channel output forced active level                            */
  MCTM_OM_PWM1            = 0x0006, /*!< MCTM channel pwm1 output mode                                      */
  MCTM_OM_PWM2            = 0x0007, /*!< MCTM channel pwm2 output mode                                      */
  MCTM_OM_ASYMMETRIC_PWM1 = 0x0106, /*!< MCTM channel asymmetric pwm1 output mode                           */
  MCTM_OM_ASYMMETRIC_PWM2 = 0x0107  /*!< MCTM channel asymmetric pwm2 output mode                           */
} MCTM_OM_Enum;
/**
 * @brief Enumeration of MCTM channel control.
 */
typedef enum
{
  MCTM_CHCTL_DISABLE = 0,           /*!< MCTM channel disable                                               */
  MCTM_CHCTL_ENABLE                 /*!< MCTM channel enable                                                */
} MCTM_CHCTL_Enum;
/**
 * @brief Enumeration of MCTM channel polarity.
 */
typedef enum
{
  MCTM_CHP_NONINVERTED = 0,         /*!< MCTM channel polarity is active high or rising edge                */
  MCTM_CHP_INVERTED                 /*!< MCTM channel polarity is active low or falling edge                */
} MCTM_CHP_Enum;
/**
 * @brief Enumeration of MCTM channel output idle state.
 */
typedef enum
{
  MCTM_OIS_LOW = 0,                 /*!< MCTM channel output low when CHMOE equal to 0                      */
  MCTM_OIS_HIGH                     /*!< MCTM channel output high when CHMOE equal to 0                     */
} MCTM_OIS_Enum;
/**
 * @brief Enumeration of MCTM COMUS.
 */
typedef enum
{
  MCTM_COMUS_STIOFF = 0,            /*!< MCTM capture/compare control bits are updated by
                                         setting the UEV2G bit only */
  MCTM_COMUS_STION                  /*!< MCTM capture/compare control bits are updated by both
                                         setting the UEV2G bit or when a rising edge occurs on STI */
} MCTM_COMUS_Enum;
/**
 * @brief Enumeration of MCTM channel capture source selection.
 */
typedef enum
{
  MCTM_CHCCS_DIRECT   = 0x00010000,  /*!< MCTM channel capture selection direct input                       */
  MCTM_CHCCS_INDIRECT = 0x00020000,  /*!< MCTM channel capture selection indirect input                     */
  MCTM_CHCCS_TRCED    = 0x00030000   /*!< MCTM channel capture selection TRCED of trigger control block     */
} MCTM_CHCCS_Enum;
/**
 * @brief Enumeration of MCTM channel capture prescaler.
 */
typedef enum
{
  MCTM_CHPSC_OFF = 0x00000000,     /*!< MCTM channel capture no prescaler, capture is done each event       */
  MCTM_CHPSC_2   = 0x00040000,     /*!< MCTM channel capture is done once every 2 event                     */
  MCTM_CHPSC_4   = 0x00080000,     /*!< MCTM channel capture is done once every 4 event                     */
  MCTM_CHPSC_8   = 0x000C0000      /*!< MCTM channel capture is done once every 8 event                     */
} MCTM_CHPSC_Enum;
/**
 * @brief Enumeration of MCTM fDTS clock divider.
 */
typedef enum
{
  MCTM_CKDIV_OFF = 0x0000,          /*!< fDTS = fCLKIN                                                      */
  MCTM_CKDIV_2   = 0x0100,          /*!< fDTS = fCLKIN / 2                                                  */
  MCTM_CKDIV_4   = 0x0200           /*!< fDTS = fCLKIN / 4                                                  */
} MCTM_CKDIV_Enum;
/**
 * @brief Enumeration of MCTM ETI input prescaler.
 */
typedef enum
{
  MCTM_ETIPSC_OFF = 0x00000000,     /*!< ETI prescaler off                                                  */
  MCTM_ETIPSC_2   = 0x00001000,     /*!< ETIP frequency divided by 2                                        */
  MCTM_ETIPSC_4   = 0x00002000,     /*!< ETIP frequency divided by 4                                        */
  MCTM_ETIPSC_8   = 0x00003000      /*!< ETIP frequency divided by 8                                        */
} MCTM_ETIPSC_Enum;
/**
 * @brief Enumeration of MCTM ETI input polarity.
 */
typedef enum
{
  MCTM_ETIPOL_NONINVERTED = 0x00000000, /*!< MCTM ETI polarity is active high or rising edge                */
  MCTM_ETIPOL_INVERTED    = 0x00010000  /*!< MCTM ETI polarity is active low or falling edge                */
} MCTM_ETIPOL_Enum;
/**
 * @brief Enumeration of MCTM slave trigger input selection.
 */
typedef enum
{
  MCTM_TRSEL_UEV1G  = 0x0,         /*!< Software trigger by setting UEV1G                                   */
  MCTM_TRSEL_TI0S0  = 0x1,         /*!< Filtered channel 0 input                                            */
  MCTM_TRSEL_TI1S1  = 0x2,         /*!< Filtered channel 1 input                                            */
  MCTM_TRSEL_ETIF   = 0x3,         /*!< Filtered external trigger input                                     */
  MCTM_TRSEL_TI0BED = 0x8,         /*!< Trigger input 0 both edge detector                                  */
  MCTM_TRSEL_ITI0   = 0x9,         /*!< Internal trigger input 0                                            */
  MCTM_TRSEL_ITI1   = 0xA,         /*!< Internal trigger input 1                                            */
  MCTM_TRSEL_ITI2   = 0xB          /*!< Internal trigger input 2                                            */
} MCTM_TRSEL_Enum;
/**
 * @brief Enumeration of MCTM slave mode selection.
 */
typedef enum
{
  MCTM_SMSEL_DISABLE  = 0x0000,     /*!< The prescaler is clocked directly by the internal clock            */
  MCTM_SMSEL_DECODER1 = 0x0100,     /*!< Counter counts up/down on CH0 edge depending on CH1 level          */
  MCTM_SMSEL_DECODER2 = 0x0200,     /*!< Counter counts up/down on CH1 edge depending on CH0 level          */
  MCTM_SMSEL_DECODER3 = 0x0300,     /*!< Counter counts up/down on both CH0 & CH1 edges depending on the
                                       level of the other input */
  MCTM_SMSEL_RESTART  = 0x0400,     /*!< Slave restart mode                                                 */
  MCTM_SMSEL_PAUSE    = 0x0500,     /*!< Slave pause mode                                                   */
  MCTM_SMSEL_TRIGGER  = 0x0600,     /*!< Slave trigger mode                                                 */
  MCTM_SMSEL_STIED    = 0x0700      /*!< Rising edge of the selected trigger(STI) clock the counter         */
} MCTM_SMSEL_Enum;
/**
 * @brief  Enumeration of MCTM master mode selection.
 */
typedef enum
{
  MCTM_MMSEL_RESET   = 0x00000000,  /*!< Send trigger signal when S/W setting UEV1G or slave restart        */
  MCTM_MMSEL_ENABLE  = 0x00010000,  /*!< The counter enable signal is used as trigger output.               */
  MCTM_MMSEL_UPDATE  = 0x00020000,  /*!< The update event 1 is used as trigger output.                      */
  MCTM_MMSEL_CH0CC   = 0x00030000,  /*!< Channel 0 capture or compare match occurred as trigger output.     */
  MCTM_MMSEL_CH0OREF = 0x00040000,  /*!< The CH0OREF signal is used as trigger output.                      */
  MCTM_MMSEL_CH1OREF = 0x00050000,  /*!< The CH1OREF signal is used as trigger output.                      */
  MCTM_MMSEL_CH2OREF = 0x00060000,  /*!< The CH2OREF signal is used as trigger output.                      */
  MCTM_MMSEL_CH3OREF = 0x00070000   /*!< The CH3OREF signal is used as trigger output.                      */
} MCTM_MMSEL_Enum;
/**
 * @brief Enumeration of GPTM channel Capture / Compare PDMA selection.
 */
typedef enum
{
  MCTM_CHCCDS_CHCCEV = 0,       /*!< Send CHx PDMA request when channel capture/compare event occurs        */
  MCTM_CHCCDS_UEV1              /*!< Send CHx PDMA request when update event 1 occurs                       */
} MCTM_CHCCDS_Enum;
/**
 * @brief Definition of MCTM timebase init structure.
 */
typedef struct
{
  u16                CounterReload;         /*!< Period (Value for CRR register)                            */
  u16                Prescaler;             /*!< Prescaler (Value for PSCR register)                        */
  u8                 RepetitionCounter;     /*!< Repetition counter                                         */
  MCTM_CNT_MODE_Enum CounterMode;           /*!< Counter mode refer to \ref MCTM_CNT_MODE_Enum              */
  MCTM_PSC_RLD_Enum  PSCReloadTime;         /*!< Prescaler reload mode refer to \ref MCTM_PSC_RLD_Enum      */
} MCTM_TimeBaseInitTypeDef;
/**
 * @brief Definition of MCTM channel output init structure.
 */
typedef struct
{
  MCTM_CH_Enum      Channel;              /*!< Channel selection refer to \ref MCTM_CH_Enum                 */
  MCTM_OM_Enum      OutputMode;           /*!< Channel output mode selection refer to \ref MCTM_OM_Enum     */
  MCTM_CHCTL_Enum   Control;              /*!< CHxO output state refer to \ref MCTM_CHCTL_Enum              */
  MCTM_CHCTL_Enum   ControlN;             /*!< CHxO output state refer to \ref MCTM_CHCTL_Enum              */
  MCTM_CHP_Enum     Polarity;             /*!< CHxO polarity refer to \ref MCTM_CHP_Enum                    */
  MCTM_CHP_Enum     PolarityN;            /*!< CHxO polarity refer to \ref MCTM_CHP_Enum                    */
  MCTM_OIS_Enum     IdleState;            /*!< CHxO polarity refer to \ref MCTM_CHP_Enum                    */
  MCTM_OIS_Enum     IdleStateN;           /*!< CHxO polarity refer to \ref MCTM_CHP_Enum                    */
  u16               Compare;              /*!< Value for CHxCCR register                                    */
  u16               AsymmetricCompare;    /*!< Value for CHxCCR register                                    */
} MCTM_OutputInitTypeDef;
/**
 * @brief Definition of MCTM channel input init structure.
 */
typedef struct
{
  MCTM_CH_Enum    Channel;         /*!< Channel selection refer to \ref MCTM_CH_Enum                        */
  MCTM_CHP_Enum   Polarity;        /*!< Channel input polarity refer to \ref MCTM_CHP_Enum                  */
  MCTM_CHCCS_Enum Selection;       /*!< Channel capture source selection refer to \ref MCTM_CHCCS_Enum      */
  MCTM_CHPSC_Enum Prescaler;       /*!< Channel Capture prescaler refer to \ref MCTM_CHPSC_Enum             */
  u8              Filter;          /*!< Digital filter Configuration, it must between 0x0 ~ 0xF.            */
} MCTM_CaptureInitTypeDef;

/**
 * @brief Definition of Break & DeadTime init structure.
 */
typedef struct
{
  u32 OSSRState;
  u32 OSSIState;
  u32 LockLevel;
  u32 Break0;
  u32 Break0Polarity;
  u32 Break1;
  u32 Break1Polarity;
  u32 AutomaticOutput;
  u8 DeadTime;
  u8 BreakFilter;
} MCTM_CHBRKCTRInitTypeDef;
/**
  * @}
  */

